### Broadcasting Operations

In [12]:
import os
import pandas as pd

os.chdir("/home/mediaworker/anaconda2/envs/pandas_playground")

nba = pd.read_csv("datasets/nba.csv")

nba["Age"].head(3)

0    25.0
1    25.0
2    27.0
Name: Age, dtype: float64

### Operation 1
####  Add integer to all the rows of one column 'Age'

In [16]:
nba["Age"].add(5).head(3)

# shorthand
(nba["Age"] + 5).head(3)

0    30.0
1    30.0
2    32.0
Name: Age, dtype: float64

### Operation 2
####  Subtract integer to all the rows of one column 'Salary'

In [19]:
c

0    7680337.0
1    6746117.0
2          NaN
Name: Salary, dtype: float64

### Operation 3
####  Multiply to all the rows of one column 'Salary'

In [21]:
nba["Salary"].mul(2).head(3)

# shorthand
(nba["Salary"] * 2).head(3)

0    15460674.0
1    13592234.0
2           NaN
Name: Salary, dtype: float64

### Operation 4
####  Re-evaluate and add to existing dataframe as new col

In [25]:
nba["Salary"].div(1000000).head(3)

# shorthand
# evaluates salary in millons and adds it as a new
# column in the end of the dataframe
nba["Salary in millions"] = (nba["Salary"] / 1000000).head(3)

In [28]:
nba["Salary in millions"].head(3)

0    7.730337
1    6.796117
2         NaN
Name: Salary in millions, dtype: float64